# Generated Mon May 12 12:54:56 EDT 2025

# ---------------------------------------
# Taps
# ---------------------------------------
tap "cirruslabs/cli"
tap "codecrafters-io/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hpedrorodrigues/tools"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "shopify/shopify"
tap "teamookla/speedtest"

# ---------------------------------------
# Brew
# ---------------------------------------
brew "openssl@3" # Cryptography and SSL/TLS Toolkit
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "biome" # Toolchain of the web
brew "fontconfig" # XML-based font configuration API for X Windows
brew "coreutils" # GNU File, Shell, and Text utilities
brew "dockutil" # Tool for managing dock items
brew "eza" # Modern, maintained replacement for ls
brew "fastfetch" # Like neofetch, but much faster because written mostly in C
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "glow" # Render markdown on the CLI
brew "unbound" # Validating, recursive, caching DNS resolver
brew "gnutls" # GNU Transport Layer Security (TLS) Library
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "grep" # GNU grep, egrep and fgrep
brew "gum" # Tool for glamorous shell scripts
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "jq" # Lightweight and flexible command-line JSON processor
brew "lazydocker" # Lazier way to manage everything docker
brew "lazygit" # Simple terminal UI for git commands
brew "lua" # Powerful, lightweight programming language
brew "luarocks" # Package manager for the Lua programming language
brew "monolith" # CLI tool for saving complete web pages as a single HTML file
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "oha" # HTTP load generator, inspired by rakyll/hey with tui animation
brew "ollama" # Create, run, and share large language models (LLMs)
brew "openjdk@17" # Development kit for the Java programming language
brew "opentofu" # Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "openvpn" # SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "pandoc" # Swiss-army knife of markup format conversion
brew "poetry" # Python package management tool
brew "postgresql@14" # Object-relational database system
brew "protobuf" # Protocol buffers (Google's data interchange format)
brew "pyenv" # Python version management
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ruff" # Extremely fast Python linter, written in Rust
brew "sheldon" # Fast, configurable, shell plugin manager
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "sonar-scanner" # Launcher to analyze a project with SonarQube
brew "starship" # Cross-shell prompt for astronauts
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "switchaudio-osx" # Change macOS audio source from the command-line
brew "tilt" # Define your dev environment as code. For microservice apps on Kubernetes
brew "tldr" # Simplified and community-driven man pages
brew "tmux" # Terminal multiplexer
brew "tokei" # Program that allows you to count code, quickly
brew "trash" # CLI tool that moves files or folder to the trash
brew "volta" # JavaScript toolchain manager for reproducible environments
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O
brew "zellij" # Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-history-substring-search" # Zsh port of Fish shell's history search
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew "cirruslabs/cli/cirrus" 
brew "cirruslabs/cli/tart" # Run macOS and Linux VMs on Apple Hardware
brew "shopify/shopify/shopify-cli" # A CLI tool to build for the Shopify platform
brew "teamookla/speedtest/speedtest" # Ookla Speedtest

# ---------------------------------------
# Casks
# ---------------------------------------
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line interface for 1Password
cask "adobe-acrobat-reader" # View, print, and comment on PDF documents
cask "asana" # Manage team projects and tasks
cask "caffeine" # Utility that prevents the system from going to sleep
cask "chatbox" # Desktop app for GPT-4 / GPT-3.5 (OpenAI API)
cask "chatgpt" # OpenAI's official ChatGPT desktop app
cask "chromium" # Free and open-source web browser
cask "claude" # Anthropic's official Claude AI desktop app
cask "displaylink" # Drivers for DisplayLink docks, adapters and monitors
cask "docker" # App to build and share containerised applications and microservices
cask "drawio" # Online diagram software
cask "dropbox" # Client for the Dropbox cloud storage service
cask "firefox" # Web browser
cask "firefox@developer-edition" # Web browser
cask "font-fira-mono-nerd-font" 
cask "font-go-mono-nerd-font" 
cask "font-hack-nerd-font" 
cask "font-jetbrains-mono-nerd-font" 
cask "font-sf-mono" 
cask "font-sf-pro" 
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "google-drive" # Client for the Google Drive storage service
cask "huggingchat" # Chat client for models on HuggingFace
cask "karabiner-elements" # Keyboard customiser
cask "lm-studio" # Discover, download, and run local LLMs
cask "localsend" # Open-source cross-platform alternative to AirDrop
cask "notion" # App to write, plan, collaborate, and get organised
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "postman" # Collaboration platform for API development
cask "protonvpn" # VPN client focusing on security
cask "raycast" # Control your tools with a few keystrokes
cask "spotify" # Music streaming service
cask "transnomino" # Batch rename utility
cask "visual-studio-code" # Open-source code editor
cask "wezterm" # GPU-accelerated cross-platform terminal emulator and multiplexer
cask "yaak" # REST, GraphQL and gRPC client
cask "zed" # Multiplayer code editor
cask "zoom" # Video communication and virtual meeting platform

# ---------------------------------------
# Mac Application Store
# ---------------------------------------


# ---------------------------------------
# VS Code Extensions
# ---------------------------------------
vscode "andenetalexander.vim-cheatsheet"
vscode "biomejs.biome"
vscode "casualjim.gotemplate"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "continue.continue"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "emeraldwalk.runonsave"
vscode "extr0py.vscode-relative-line-numbers"
vscode "fosshaas.fontsize-shortcuts"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "magdalenalipka.tokyo-night-frameless"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rlivings39.fzf-quick-open"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
